//Task name label
HSDTaskName = "Faksilokit";

HSDFaxLogsDescription = "Valitse valintaruuduilla faksinumerot, jotka haluat estää tai joiden eston haluat poistaa, ja valitse Käytä.";

//Table view table titles
HSDTableColumnTitleType = "Tyyppi";
HSDTableColumnTitleDate = "Päivä";
HSDTableColumnTitleTime = "Aika";
HSDTableColumnTitleDuration = "Kesto";
HSDTableColumnTitlePages = "Sivut";
HSDTableColumnTitleResult = "Tulos";
HSDTableColumnTitleFaxNumber = "Faksinumero";
HSDTableColumnTitleBlock = "Estä";

//Button titles
HSDPrintButtonTitle = "Tulosta faksin aktiviteettiloki";
HSDApplyButtonTitle = "Ota käyttöön";

//Printing progress title
PrintingProgressTitle = "Tulostetaan… Odota";

//Table view menu items
ReceivedFaxesLogMenuItemTitle = "Vastaanotettujen faksien loki";
SentFaxesLogMenuItemTitle = "Lähetettyjen faksien loki";
AllFaxesLogMenuItemTitle = "Kaikki faksilokit";

//Max limit for fax blocking list reached error
FaxBlackListLimitErrorTitle = "Estettyjen numeroiden enimmäismäärä täynnä";
FaxBlackListLimitErrorDescription = "Laite voi tallentaa enintään %d estettyä faksinumeroa. Poista joidenkin faksinumeroiden esto ja yritä uudelleen.";

// explanation why the fax setting were not applied
FaxNotAppliedExplanation = "Varmista, että laite on online-tilassa eikä käsittele faksaustyötä.";

//Fax session types
SentSessitonType = "Lähetetty";
RecievedSessionType = "Vastaanotettu";

//Fax log results
SuccessResultCode = "Onnistunut";
ErrorResultCode = "Virhe";
BusyResultCode = "Varattu";
NoAnswerResultCode = "Ei vastausta";
NoDialToneResultCode = "Ei valintaääntä";
NoDocumentResultCode = "Ei asiakirjaa";
DocumentJamResultCode = "Paperitukos";
DoorOpenResultCode = "Luukku auki";
PowerFailureResultCode = "Virtavirhe";
BlacklistedResultCode = "Mustalla listalla";
StorageFullResultCode = "Tallennus täynnä";
OutOfMemoryResultCode = "Muisti täynnä";
PhoneLineUnavailableResultCode = "Puhelinlinja ei käytettävissä";
FaxDisconnectedResultCode = "Ei faksiyhteyttä";
PCDisconnectedResultCode = "Ei tietokoneyhteyttä";
RemoteNotColorResultCode = "Etä - ei väriä";
CommunicationErrorResultCode = "Tiedonsiirtovirhe";
CancelledResultCode = "Peruutettu";

